[
    {
    "titulo": "Por que Shitcoins Não Funcionam?",
    "autor": "Walter Victor",
    "conteudo": "Grande parte das pessoas ficaram surpresas quando viram a minha atuação no Twitter. Para quem não viu, eu fingi ser um membro da comunidade da Monero. Isso mesmo. De repente, um bitcoiner maximalista que participou de vários programas e agregou muito valor para a comunidade escrevendo livros e artigos, muda para a comunidade da criptomoeda Monero. Isso claramente levantou suspeita em algumas pessoas, e reconheço isso. Mas algumas pessoas se dedicaram a me refutar e, de fato, algumas conseguiram. E por isso meu respeito por elas aumentou. Alguns de meus amigos também ficaram curiosos e me perguntaram várias coisas. No entanto, essa atuação toda fez parte parte do plano para publicar esse artigo.\nAntes de começar esse artigo, quero deixar explícito que ele não passa de uma readaptação simplificada de um livro interminado que escrevi no início de 2024. Nesse livro, eu adentrava as mais perversas comunidades shitcoiners, explorava seus argumentos e os refutava no livro. Esse artigo fará o mesmo, mas de forma um pouco mais breve e resumida.\n\n1. O que é descentralização?\nTalvez a maior diferença do Bitcoin para as outras criptomoedas (e sim, apesar do termo 'cripto' ter 'perdido' o sentido, o próprio Satoshi Nakamoto chamou o Bitcoin de 'cryptocurrency') seja a descentralização. E essa descentralização não foi atingida somente pelas características pragmáticas do protocolo, claro, essa tem sua parte essencial, mas principalmente o Bitcoin é descentralizado pelo tamanho inimaginável que o protocolo conseguiu atingir ao longo do tempo. Hoje, em algumas estatísticas, mais de 100 mil nodes circundam a rede, dos quais 20 mil são públicos. Hoje, Bitcoin tem cerca de 300 a 600 mil transações por dia, o que é impressionante, porque Bitcoin tem blocos pequenos e mesmo assim consegue ser uma das criptomoedas que mais gerencia transações diárias. Voltando ao assunto, descentralização é tudo aquilo que é gerenciado por 2 ou mais pessoas. Claro, quanto mais, melhor. Mas se não existe somente uma autoridade central, e sim 2 ou dezenas a centenas (como no caso do Bitcoin), o protocolo já passa a ser considerado descentralizado. O Bitcoin é descentralizado tanto nos nodes (como já deixei em evidência aqui), quanto na mineração (basta aplicar a lógica para ver que são dezenas de pools principais que tem milhares de mineradores cada), quanto no desenvolvimento. E arrisco dizer que a descentralização do desenvolvimento é a mais importante possível e o Bitcoin é a única moeda que atingiu isso com maestria.\nSeparei outro parágrafo para falar com mais liberdade dessa terceira camada de descentralização que é extremamente importante. O Bitcoin hoje é descentralizado no desenvolvimento, mas nem sempre foi assim. Na verdade, começou com o exato oposto. No início do Bitcoin, o desenvolvimento era extremamente centrado em Satoshi Nakamoto. Depois de Satoshi desaparecer e deixar o projeto para a comunidade, Gavin assumiu o papel de 'Satoshi' mas ele logo saiu do projeto também. Ou seja, as únicas duas personalidades que, em algum momento, tinham mais influência no consenso do desenvolvimento, já foram embora do protocolo e não exercem mais influência alguma no mesmo.\n\n2. Analisando as outras criptos e sua descentralização\nVou analisar aqui três criptomoedas principais. Ethereum, Monero e Bitcoin Cash, porque esses são os protocolos dos quais mais estive por dentro das comunidades nos últimos tempos.\n\n2.1.: Ethereum: A Ethereum não tem descentralização de full nodes, que já mencionei várias vezes ser também uma das camadas de descentralização mais importante. Isso se dá pelo fato do extremo custo que é necessário para rodar um full node do Ethereum. Podem existir diversos full nodes na Ethereum? Sim, isso o torna descentralizado? Sim, mas é descentralizado e o poder da rede está nas mãos dos indivíduos simples e regulares? Não. Somente na mão dos big players, institucionais e shitcoins. Além disso, Vitalik exerce hoje a influência no Ethereum que Satoshi exercia no início do Bitcoin, o que é péssimo para a descentralização. E pior ainda, ele é doxxado. Se algum governo ou empresa quiser força-lo a aplicar alguma mudança no protocolo, usando do seu carisma para convencê-los (a comunidade), sem dúvidas eles conseguirão e adeus descentralização! Sobre a mineração, na Ethereum não existe. O que também é péssimo, argumentam alguns maximalistas por diversos motivos. Não entrarei nesse debate aqui, mas sinta-se livre para acompanhar e formar sua opinião.\n\n2.2.: Monero: A Monero é uma boa criptomoeda de privacidade. Na realidade, era, até no passado. Hoje, é extremamente difícil pro indivíduo comum não ser rastreado também na Monero (acompanhe os posts do Super Testnet no Twitter). A Monero só é considerada descentralizada em dois dos três fatores: Full nodes. Rodar um nó Monero é tão fácil quanto rodar um nó Bitcoin, e na mineração: Na mineração da Monero, os indivíduos podem trabalhar usando os próprios computadores em casa. Isso é uma coisa boa, assumo, mas isso pode prejudicar a segurança, já que é extremamente (des-)lucrativo minerar Monero em casa, privando a rede de atingir o máximo de Hashrate que ela poderia atingir no futuro. Como no Bitcoin as ASICs conseguem ter lucro, a segurança da rede também aumenta, porque isso é um incentivo para cada vez mais colocarem mais Hashpower na rede, consequentemente protegendo-a. A Monero era uma boa criptomoeda até inventarem a Lightning que, por sua vez, é extremamente mais privada. As transações na Lightning literalmente não existe, enquanto na Monero existe uma chance de 1 em x (x sendo < 15) de encontrarem o verdadeiro sender de uma transação. Sobre o desenvolvimento, isso é preocupante. Existe apenas uma equipe principal de desenvolvedores e a comunidade parece aceitar, sem questionar, tudo o que esses desenvolvedores colocam sobre a mesa. Isso é preocupante, na minha opinião, e prefiro evitar isso. Pode-se dizer que a comunidade tem ideias extremamente homogêneas, sem muitos debates entre si na comunidade, o total oposto do que acontece no Bitcoin.\n\n2.3.: Bitcoin Cash: O Bitcoin Cash é um hard-fork da rede do Bitcoin que ocorreu em 2017. Junto com esse fork veio a mudança de permitirem blocos grandes, isso é, nos blocos caberiam mais transações que o usual, permitindo que o Bitcoin 'escalasse' para um maior número de pessoas. Apesar disso ser um fato, isso trás consequências extremamente negativas no longo prazo. Com o aumento do tamanho do bloco, fica mais caro dos indivíduos rodarem full nodes, 'sacrificando' uma das camadas mais importantes da descentralização. Não tem muito o que falar do Bitcoin Cash, já que é basicamente um Bitcoin com o limite dos blocos maior. É também minerado por ASICs e tem vários desenvolvedores. Talvez eu possa atacar esse protocolo no sentido de que, assim como a comunidade da Monero, ele é extremamente homogêneo em opiniões e ideias.\n\n3. Argumentos comuns anti-Bitcoin\nComo dito, por muito eu me adentrei em diversas comunidades shitcoiners e cheguei a conclusão de anotar algumas das perguntas/argumentos mais comuns que eles tinham para atacar o Bitcoin. Nesse capítulo vou me aprofundar nos argumentos mais comuns e refuta-los.\n\n3.1.: Bitcoin não escala: Quando você compreende o conceito de como os blocos do Bitcoin funcionam, você de fato pode chegar a essa conclusão. Que, pelo menos, em primeira camada, Bitcoin não escala. Mas isso é falso. Bitcoin NA PRIMEIRA CAMADA facilita ou permite a escalabilidade de toda a rede através de sidechains (drivechains) ou através da própria Lightning. Foi com uma mudança na primeira camada que a Lightning se permitiu ser criada. Na realidade, com as drivechains, Bitcoin pode escalar até mesmo para TODAS AS PESSOAS do mundo, com privacidade e auto-custódia. Essa mudança já está pronta para ser aplicada, só requere mais debates na comunidade e aceitação.\n\n3.2.: Bitcoin é rastreável/infungível: Isso é verdade, mas é uma feature, não um bug. Quando o Bitcoin surgiu, era extremamente necessário para o marketing do protocolo a questão de 'verifique você mesmo'. Em outras criptomoedas anônimas isso é mais difícil, principalmente para um iniciante, apesar de não ser impossível. Agora, se você quer privacidade no Bitcoin, recomendo fortemente que você rode seu próprio nó Lightning e faça todas suas transações comerciais por lá. A privacidade da Lightning é de longe superior às privacidades de Monero, Zcash, etc, como já dito aqui nesse artigo anteriormente.\n\n3.3.: Bitcoin não tem security funding: Essa teoria vem desde os primórdios do Bitcoin e ela alega que o Bitcoin não terá transações o suficiente para suprir a necessidade de recompensa dos mineradores quando o Halving quebrar os subsídios pela metade. Essa teoria pode ser quebrada na ideia de que, já no último Halving, muito antes disso sequer ser uma preocupação real dos mineradores, múltiplos blocos já tiveram recompensa maior pelas taxas do que pelos subsídios. E a tendência é esse tipo de comportamento se tornar mais comum a cada Halving.\n\n3.4.: Bitcoin tem taxas caras: Você pode usar segundas camadas como a Lightning Network que tem taxas quase que inexistentes ou múltiplas drivechains quando elas forem implementadas. Você escolhe. Se você precisa transacionar na primeira camada e as taxas lhe incomodam, pense que você está pagando para a maior rede de computadores do mundo, com o poder computacional mais poderoso do mundo, proteger sua transação. Daí, vendo por esse ponto de vista, vai parecer que está, na realidade, muito barato.\n\n3.5.: Bitcoin não tem privacidade: Na realidade, tem diversas formas de se ter privacidade usando Bitcoin, como usando a tecnologia de 'silent payments' (facilmente acessada pela Cake Wallet) ou Payjoin. Essas são ferramentas de privacidade que estão no código do Bitcoin. Não em segundas camadas, em projetos paralelos. E sim na própria blockchain do Bitcoin. Você também pode rodar seu próprio Nó Lightning com facilidade usando de novas ferramentas que estão surgindo para fazer pagamentos 100% anônimos na Lightning.\n\n4. Refutando a narrativa Monerista\nPelo fato de ser um entusiasta de tecnologias, e tenho a audácia de me auto-denominar cypherpunk, eu pessoalmente gosto muito da tecnologia da Monero. Muitos pensam que a chance de encontrarem uma pessoa que usa Monero é nula. Mas você sabia que não é bem assim? Se você não rodar nó próprio, não fazer OPSEC correto, você provavelmente será pego. E adivinha, esse OPSEC requerido para usar Monero com segurança é o mesmo para se usar Bitcoin. No entanto, é verossímil que é muito melhor usar Bitcoin como reserva de valor com esse OPSEC já pré-estabelecido do que se arriscar na Monero só por causa de uma 'privacidade adicional'. Essa privacidade adicional de fato existe e é ótima, tanto é que o mercado da deep web optou por ela, mas não é a necessidade de todas as pessoas e isso é ilustrado no gráfico. Longe de mim defender que privacidade não é necessário, muito pelo contrário, sou um reinvindicador de privacidade assíduo no Bitcoin, mas está fora do nosso escopo ajudar todos a terem privacidade. Nem todos querem ou se importam com isso.\nTangenciei um pouco o assunto. Vamos voltar do começo. Como já citei no meu livro, eu gosto de citar Descartes quando vou começar a explicar algo, de modo que descontruo o que conheço até chegar num princípio que podemos chamar de 'universal'. Fazendo isso em meu livro, cheguei a conclusão de que Bitcoin é um software, isso é, um programa de computador. E assim como todo programa de computador, é lógico afirmar que Bitcoin pode ter melhorias ou se adaptar ao longo do tempo para melhor servir às necessidades de seus usuários, como foi o caso do SegWit e Taproot. Contudo, fica evidente que, se ainda não inventaram ferramentas de privacidade no Bitcoin, hão de inventar uma hora ou outra, afinal, o software é código-aberto. Todos podem construir em cima dele. Mas, na realidade, e se eu te falar que os Moneristas que lhe dizem que não existe privacidade inata no Bitcoin estão mentindo? Existem, na verdade, não só uma, mas duas ferramentas de privacidade que estão diretamente na primeira camada que servem para incrementar na privacidade dos usuários. Elas se chamam silent payments e payjoin. Ambas podem ser facilmente acessadas na Cake Wallet. Além disso, o Bitcoin tende a adotar drivechains no futuro (com ou sem fork, existem outros artigos sobre isso, depois pesquise) e nessas drivechains será totalmente possível existir uma 'Monero drivechain', aonde o nome Monero vem apenas da similaridade das regras do protocolo, enquanto a mineração e a moeda usada nessa rede vem do Bitcoin. Nessa realidade, Monero se torna inútil. Por que comerciantes vão ter o trabalho de, toda vez que forem gastar ou receber BTC, terem de mudar pra XMR e depois trocar para BTC novamente (para não perder valor ao longo do tempo) enquanto eles poderão só usar uma drivechain no Bitcoin com a mesma privacidade, auto-custódia, rapidez e hashrate?\nEssa é minha crítica principal à Monero e ao Holding de Monero: Mais de um destino diferente do futuro podem levar à inutilização e substituição da sua moeda pelo Bitcoin. É muito melhor o esforço que eu gastaria divulgando a moeda Monero eu gastasse divulgando essas mudanças que permitiram tais grandes feitos na rede do Bitcoin.\nApós passar tantas horas na comunidade da Monero, até mesmo minerando Monero, eu devo reconheçer que eles lutam por uma boa causa, mas a mesma boa causa existe também inteiramente no Bitcoin.\n\n5. Refutando qualquer shitcoin\nNão é pelo fato de sua shitcoin poder processar milhões de transações por segundo ou dezenas de blocos por segundo que a mesma está apta à cair no gosto da população. Bitcoin caiu no gosto do povo pelo fato de ser rígido, o primeiro, e ter um máximo de 21 milhões. Sua shitcoin ser simplesmente mais rápida ou barata não são argumentos o suficiente para fazer o povo a adotar. Talvez o argumento mais nobre de um shitcoiner seja a privacidade, e de fato, o livre-mercado em alguns lugares escolhe privacidade, mas ainda existem motivos pelos quais alguns usuários preferem transparência em primeira camada e/ou privacidade em segunda (em camadas de pagamentos). No entanto, fica verossímil que, Bitcoin é um software, e que pode adotar qualquer tecnologia nova que esteja por aí. Seja ela ring signatures, BlockDAG, etc, tudo em drivechains ou segundas camadas, ainda mantendo a auto-custódia. Existe várias BIPs (Bitcoin Improvement Proposals) que permitem isso, como CAT, CTV, 300/301, etc. Se qualquer uma dessas BIPs forem aprovadas ou nem isso. Se descobrirem formas de implementarem essas BIPs sem modificar o código original do Bitcoin, até mesmo a tecnologia (único ponto positivo das shitcoins) das shitcoins ficará obsoleta.\n\nAgora é o perfeito momento para finalizar esse artigo com uma conclusão. Existem dois pontos positivos principais que uma criptomoeda pode ter: um ponto positivo no quesito de tecnologia e no quesito econômico. No quesito econômico, somente Bitcoin o atingiu, por isso somente ele é o colateral supremo. Bitcoin tem a escassez digital. Mesmo no quesito de tecnologia que o Bitcoin pode ficar um pouco 'prá trás', ele pode adotar as tecnologias que deram certo tanto em primeira quanto em segunda camada, portanto, isso não é uma preocupação."
    },
  {
    "titulo": "Bitcoin e os Pobres | Tradução por Leta",
    "autor": "Mircea Popescu",
    "conteudo": "“Sem dúvida, qualquer sistema que tome o lugar do sistema atual, Bitcoin ou não, acabará por precisar de um patch, depois outro e assim por diante. Para esse fim, sugiro que não é apenas nosso dever substituir o sistema atual, gostemos ou não dos banqueiros, mas também devemos ter o cuidado de nunca nos tornarmos banqueiros. O Bitcoin é descentralizado, removendo o único ponto de falha que esses bancos estão tentando defender. Bitcoin é pequeno, simples e ágil, removendo a pegada de ataque tremendamente grande que os bancos têm que enfrentar. Bitcoin é a comunidade e a comunidade é o Bitcoin — ainda somos pequenos e temos a oportunidade de determinar, até certo ponto, nossos próprios padrões de crescimento. Vamos ter certeza de que a comunidade sempre entende o que estamos fazendo aqui hoje e reconhece quando é hora de repetir a história. É um dia que espero que esteja muito distante, mas que ainda devemos planejar. Estamos cultivando as raízes da revolução monetária, vamos garantir que sejam saudáveis e profundas”.\nAs quinhentas ou mais palavras que precedem a citação são, em sua maioria, ultra-resumos ingênuos de um assunto vasto e mal compreendido — o tipo de prosa sem sentido que inevitavelmente compõe ensaios do ensino médio. Claro, os professores marcam com A’s e B’s porque isso é o máximo que se pode razoavelmente esperar dos adolescentes: resumo-do-resumo-do-resumo enfadonho, desinformado e desinteressante. Contanto que não esteja totalmente incorreto, ele obtém seu A.\nA propósito, a mesma coisa acontece na Internet, porque isso é o máximo que se pode esperar dos vinte e poucos anos e, em grande parte, dos trinta também. Então, normalmente você aperta sua mão naquele gesto característico e continua, na maior parte do tempo. Exceto … nesta citação há uma abundância de chocantemente incorreta.\nPor um lado, a noção de que “também devemos tomar cuidado para nunca nos tornarmos os banqueiros” é bobagem. Para ficar com o reino do facilmente digerível: as velhas impressoras rotativas do New York Times podem ser substituídas pelos novos métodos digitais de Trilema ou “Coding In My Sleep” ou qualquer outra coisa. O trabalho do editor, entretanto, não vai embora: as letras ainda formam as palavras e as palavras ainda precisam ser selecionadas. Esse é o editor, quer suas mãos estejam manchadas de tinta e seus pulmões cheios de poeira de chumbo ou apenas seus pulsos doam com o CTS e seus olhos estejam rosados ​​pelo brilho do monitor, o editor é o editor. E também o colunista, seja ele funcionário ou independente, escrevendo para o jornal ou para o seu próprio blog, ao contrário do que Gregory Ferenstein gostaria de acreditar que o colunista nunca vai embora, assim como as pessoas não param de falar e passam a usando números para se comunicarem.\nEntão, seremos banqueiros. Neste ou naquele sistema, antigo, novo, quadrado ou redondo, desde que tenha a ver com dinheiro, seremos banqueiros. Claro, nem todos nós, ninguém precisa ser banqueiro se não quiser. Claro, não temos que usar os mesmos métodos, construções, processos ou conceitos, nem é provável que o façamos. Mas os banqueiros existirão para sempre, ou para ser mais preciso, enquanto houver dinheiro.\nO que, aliás, nos leva a um ponto prático: todos os tipos de ideólogos mal-acabados, quase toda a escória culturalmente marginal que espuma nas bordas da sociedade, todos os “ativistas” e “anarquistas” e “comunistas” e “do contras” em geral, eles chamam de sua própria incapacidade de enfrentar, de realizar e de prosperar no mundo, vêem o Bitcoin como uma espécie de presente de cima, feito por seu pai diretamente para eles.\nBem … Bitcoin não é absolutamente nada disso. O Bitcoin não torna as coisas mais fáceis para os anticapitalistas, mas sim mais difíceis. O Bitcoin não torna isso mais fácil para os anticorporativistas, ele torna isso mais difícil. O Bitcoin, especialmente, não torna isso mais fácil para os socialistas, para aquelas pessoas que desprezam a hierarquia e fingem igualdade: torna isso impossível. Simplesmente impossível.\nBitcoin é a coisa mais conservadora desde, pelo menos, a rainha Victoria, se não completamente Jesus. Bitcoin torna inviáveis os chamados esquemas fiscais “progressivos”. O Bitcoin torna qualquer tipo de bem-estar público insustentável. O Bitcoin torna a pretensão de igualdade de qualquer pessoa risível. O Bitcoin não está aqui para “fazer as comunas funcionarem”, mas muito pelo contrário: tornará as comunas inoperantes e desinteressantes para quase todos. Depois de acabar com a porcaria que essas mesmas pessoas colocaram no governo, uma vez que estamos de volta a algo muito mais parecido com o que os estados escravistas tinham antes da Guerra Civil (e é exatamente para isso que estamos indo, e é exatamente isso o que foi esse conflito: uma disputa entre o Grande Governo e indivíduos — infelizmente p Grande Governo ganhou), obviamente estaremos em uma posição muito melhor para entender intuitivamente tudo isso. Afinal, a retrovisão é sempre 20/20.\nVoltando, “o Bitcoin é descentralizado, removendo o único ponto de falha que esses bancos estão tentando defender” também é papo-furado. Que ponto único exato de falha os bancos estão tentando defender? Como exatamente o Bitcoin é “pequeno, simples e ágil” dado que a maldita blockchain já utiliza Gigabytes em um momento que ninguém está praticamente usando ainda? Que simplicidade é essa, quando começar a usar exige cinquenta ou cem horas de pesquisa? Como isso se compara aos bancos que enviam cartões de crédito de adolescentes pelo correio, sem serem vistos?\nToda essa regurgitação de bytes sonoros previamente engolidos inteiros tem que cessar. Não há “pegada de ataque” e, de fato, a pessoa média que mantém os seus bitcoins tem uma seção transversal atacável significativamente maior do que o banco médio (em grande parte porque o banco médio não passa por bares decadentes e tocas habitadas por prostitutas duvidosas com o cofre no bolso e as chaves no outro bolso, por exemplo). Na verdade, o total de “hacks” de Bitcoin neste ano conta entre 1 e 10% da faixa de massa monetária total. No dia em que o sistema bancário conseguir ser hackeado por 0,1% do M3, ligue para mim. Você pode fazer cobrar, eu pago.\nMas a parte mais ofensiva de tudo isso é o “Bitcoin é o sindicato dos trabalhadores e o sindicato dos trabalhadores é o Bitcoin” copiado e colado diretamente de Nadezhda Krupskaya ou alguma porcaria. Não, não é. Bitcoin não é uma “comunidade”, Bitcoin é simplesmente matemática. Ele poderia se importar menos com qualquer comunidade, nem hmm, como foi a citação …\n“O Bitcoin Miner escreve; e, tendo escrito, segue em frente: nem toda a sua piedade ou inteligência o atrairá de volta para cancelar a metade de uma linha, nem todas as suas lágrimas lavarão uma palavra dela.”\nIsso é o que é Bitcoin. Destino. Envie uma única transação e, em seguida, realize todas as vigílias, ativismo, protestos ou qualquer outra coisa para ela ser devolvida. Veja como isso funciona bem, por que não?\nBitcoin é o destino. Ele opera completamente fora de qualquer agência humana, mesmo que tenha sido (possivelmente) algumas pessoas que o criaram. Por tudo que você sabe sobre quem era Nakamoto …o Bitcoin poderia muito bem ter se auto criado.\nA maneira como o destino funciona é bastante simples: faça a coisa certa e você participará dela. Faça a(s) coisa(s) errada(s) e você ficará no escuro, amontoando-se nos cantos, se perguntando o que deu errado e por que o “mainstream” e o “sistema” o oprime tanto. E essa “coisa certa” quase nunca tem nada a ver com o que “a comunidade” pensa, quer ou imagina.\nAfinal, é matemática."
  },
  {
    "titulo": "Um Manifesto Cypherpunk | Traduzido",
    "autor":"Eric Hughes",
    "conteudo": "A privacidade é necessária para uma sociedade aberta na era eletrônica. \nPrivacidade não é segredo. Uma questão privada é algo que alguém não quer que o mundo inteiro saiba, mas uma questão secreta é algo que alguém não quer que ninguém saiba. Privacidade é o poder de revelar seletivamente a si mesmo para o mundo.\nSe duas partes têm algum tipo de relação, então cada uma tem uma memória da sua interação. Cada parte pode falar sobre sua própria memória disso; como alguém poderia impedir isso? Poderia-se criar leis contra isso, mas a liberdade de expressão, ainda mais do que a privacidade, é fundamental para uma sociedade aberta; não buscamos restringir nenhum tipo de fala. Se muitas partes falam juntas em um mesmo fórum, cada uma pode falar para todas as outras e agregar conhecimento sobre indivíduos e outras partes. O poder das comunicações eletrônicas tornou esse tipo de fala em grupo possível, e isso não desaparecerá simplesmente porque queiramos.\nComo desejamos privacidade, devemos garantir que cada parte em uma transação conheça apenas aquilo que é diretamente necessário para a transação. Como qualquer informação pode ser falada, devemos garantir que revelemos o mínimo possível. Na maioria dos casos, a identidade pessoal não é relevante. Quando compro uma revista na loja e entrego dinheiro ao atendente, não há necessidade de saber quem eu sou. Quando peço ao meu provedor de correio eletrônico para enviar e receber mensagens, ele não precisa saber para quem estou falando, o que estou dizendo ou o que os outros estão me dizendo; ele só precisa saber como entregar a mensagem e quanto eu devo em taxas. Quando minha identidade é revelada pelo mecanismo subjacente da transação, não tenho privacidade. Não posso aqui revelar seletivamente a mim mesmo; devo sempre me revelar.\nPortanto, a privacidade em uma sociedade aberta requer sistemas de transação anônimos. Até agora, o dinheiro em espécie tem sido o principal sistema desse tipo. Um sistema de transação anônimo não é um sistema de transação secreto. Um sistema anônimo capacita os indivíduos a revelar sua identidade quando desejarem e somente quando desejarem; essa é a essência da privacidade.\nPrivacidade em uma sociedade aberta também requer criptografia. Se digo algo, quero que seja ouvido apenas por aqueles a quem eu o destinei. Se o conteúdo do meu discurso estiver disponível para o mundo, não tenho privacidade. Criptografar é indicar o desejo de privacidade, e criptografar com criptografia fraca indica um desejo não muito forte por privacidade. Além disso, revelar sua identidade com segurança, quando o padrão é o anonimato, requer assinatura criptográfica.\nNão podemos esperar que governos, corporações ou outras grandes organizações sem rosto nos concedam privacidade por bondade. É do interesse deles falar sobre nós, e devemos esperar que o façam. Tentar impedir sua fala é lutar contra as realidades da informação. A informação não apenas quer ser livre, ela anseia por ser livre. A informação se expande para preencher o espaço de armazenamento disponível. A informação é o primo mais novo e mais forte do rumor; a informação é mais rápida, tem mais olhos, sabe mais, e entende menos que o rumor.\nDevemos defender nossa própria privacidade se quisermos tê-la. Devemos nos unir e criar sistemas que permitam que transações anônimas aconteçam. As pessoas defendem sua própria privacidade há séculos com sussurros, escuridão, envelopes, portas fechadas, apertos de mão secretos e mensageiros. As tecnologias do passado não permitiam forte privacidade, mas as tecnologias eletrônicas permitem.\nNós, os Cypherpunks, somos dedicados a construir sistemas anônimos. Estamos defendendo nossa privacidade com criptografia, sistemas anônimos de encaminhamento de correio, assinaturas digitais e dinheiro eletrônico.\nCypherpunks escrevem código. Sabemos que alguém tem que escrever software para defender a privacidade, e como não podemos ter privacidade a menos que todos o façam, nós vamos escrevê-lo. Publicamos nosso código para que outros Cypherpunks possam praticar e brincar com ele. Nosso código é livre para todos usarem, mundialmente. Não nos importamos muito se você não aprova o software que escrevemos. Sabemos que software não pode ser destruído e que um sistema amplamente disperso não pode ser fechado.\nOs Cypherpunks deploram regulações sobre criptografia, pois a criptografia é fundamentalmente um ato privado. O ato de criptografar, de fato, retira informação do domínio público. Mesmo leis contra criptografia só alcançam até a fronteira da nação e o braço da sua violência. A criptografia inevitavelmente se espalhará pelo globo todo, e com ela os sistemas de transação anônimos que ela possibilita.\nPara que a privacidade seja difundida, ela deve fazer parte de um contrato social. As pessoas devem se unir e implantar esses sistemas para o bem comum. A privacidade só se estende até a cooperação dos colegas da sociedade. Nós, os Cypherpunks, buscamos suas perguntas e preocupações e esperamos que possamos dialogar para não nos iludirmos. No entanto, não seremos desviados do nosso caminho porque alguns discordem de nossos objetivos.\nOs Cypherpunks estão ativamente engajados em tornar as redes mais seguras para a privacidade. Vamos avançar juntos rapidamente.\nAvante.\nEric Hughes\nhughes@soda.berkeley.edu\n9 de março de 1993"
  },
  {
    "titulo":"Bitcoin: Um Sistema de Dinheiro Eletrônico Peer-to-Peer",
    "autor":"Satoshi Nakamoto",
    "conteudo":"Uma versão puramente peer-to-peer de dinheiro eletrônico permitiria que pagamentos online fossem enviados diretamente de uma parte para outra sem passar por uma instituição financeira. Assinaturas digitais fornecem parte da solução, mas os principais benefícios são perdidos se ainda for necessária uma terceira parte confiável para evitar o gasto duplo.\nPropomos uma solução para o problema do gasto duplo usando uma rede peer-to-peer. A rede carimba as transações em blocos contínuos de hash, formando um registro que não pode ser alterado sem refazer a prova de trabalho. A cadeia mais longa serve como prova da sequência de eventos presenciada e de que veio do maior conjunto de poder computacional.\nEnquanto a maioria do poder computacional for controlada por nós honestos, a cadeia mais longa superará os atacantes. A própria rede requer estrutura mínima. As mensagens são transmitidas com base no melhor esforço, e os nós podem sair e entrar da rede à vontade, aceitando a cadeia de prova de trabalho como prova do que aconteceu enquanto estavam fora.\n\n1. Introdução\nO comércio na Internet passou a depender quase exclusivamente de instituições financeiras que atuam como terceiros confiáveis para processar pagamentos eletrônicos. Embora o sistema funcione bem o suficiente para a maioria das transações, ele ainda sofre das fraquezas inerentes ao modelo baseado em confiança.\nTransações completamente irreversíveis não são realmente possíveis, pois instituições financeiras não podem evitar disputas de mediação. O custo da mediação aumenta os custos das transações, limitando o tamanho mínimo prático e eliminando a possibilidade de transações casuais pequenas.\nCom a possibilidade de reversão, a necessidade de confiança se espalha. Comerciantes devem ser cautelosos com seus clientes, incomodando-os com mais informações do que deveriam. Um percentual certo de fraude é aceito como inevitável. Esses custos e incertezas podem ser evitados com um sistema de pagamento eletrônico baseado em provas criptográficas em vez de confiança.\nUm sistema como esse permitiria que duas partes dispostas transacionassem diretamente uma com a outra sem a necessidade de uma terceira parte confiável. As transações seriam computacionalmente impraticáveis de reverter, protegendo os vendedores de fraude, e mecanismos rotineiros de custódia poderiam ser facilmente implementados para proteger os compradores.\nNeste artigo, propomos um sistema para transações eletrônicas sem confiança, usando uma rede peer-to-peer distribuída para resolver o problema do gasto duplo.\n\n2. Transações\nDefinimos uma moeda eletrônica como uma cadeia de assinaturas digitais. Cada proprietário transfere a moeda para o próximo assinando digitalmente um hash da transação anterior e a chave pública do próximo proprietário e adicionando-os ao fim da moeda.\nO destinatário pode verificar as assinaturas para verificar a cadeia de propriedade. O problema, claro, é que o destinatário não pode verificar se um dos proprietários não gastou a moeda duas vezes. Uma solução comum é introduzir uma autoridade central confiável, ou casa da moeda, que verifica todas as transações para detectar o gasto duplo. O problema com essa solução é que o destino de todo o sistema de dinheiro depende da empresa que opera a casa da moeda, com cada transação tendo que passar por ela, assim como um banco.\nPrecisamos de uma forma de o destinatário saber que os donos anteriores não assinaram nenhuma transação anterior. Para nosso propósito, a primeira transação é a que conta, então não nos importamos com tentativas subsequentes de gastar duas vezes. A única forma de confirmar a ausência de uma transação é estar ciente de todas as transações. No modelo baseado em casa da moeda, a casa da moeda estava ciente de todas as transações e decidia qual chegou primeiro. Para isso, precisamos que todas as transações sejam anunciadas publicamente e precisamos de um sistema para que os participantes concordem com um único histórico da ordem em que elas foram recebidas.\nO destinatário precisa de prova de que, no momento de cada transação, a maioria dos nós concordou que ela foi a primeira recebida.\n\n3. Servidor de Carimbo de Data/Hora\nA solução que propomos começa com um servidor de carimbo de data/hora. Ele pega um hash de um bloco de itens a ser carimbado e publica amplamente o hash, como em um jornal ou em um post na internet. O carimbo de data/hora prova que os dados devem ter existido naquele momento, evidentemente, para entrar no hash. Cada carimbo de data/hora inclui o hash do carimbo anterior em seu hash, formando uma cadeia, com cada carimbo reforçando os anteriores.\n\n4. Prova de Trabalho\nPara implementar um servidor de carimbo de data/hora distribuído peer-to-peer, precisamos usar um sistema de prova de trabalho semelhante ao Hashcash, ao invés de depender de um jornal ou site. A prova de trabalho envolve escanear por um valor que, quando hashado com SHA-256, começa com um número de bits zero. O trabalho médio necessário é exponencial no número de bits zero exigidos, mas a verificação é feita com um único hash.\nPara nossa rede de carimbo de data/hora, implementamos a prova de trabalho incrementando um nonce no bloco até que se encontre um valor que dê o hash com os bits zero requeridos. Uma vez que o poder de CPU é gasto para satisfazer a prova de trabalho, o bloco não pode ser alterado sem refazer o trabalho. Como blocos subsequentes são encadeados, alterar um bloco exigiria refazer todo o trabalho dos blocos seguintes.\nA prova de trabalho também resolve o problema de como representar decisão por maioria. Se a maioria do poder de CPU for controlado por nós honestos, a cadeia mais longa sempre será confiável como a verdadeira. Para modificar um bloco passado, um atacante teria que refazer a prova de trabalho daquele e de todos os blocos após ele, além de ultrapassar o trabalho dos nós honestos. A probabilidade de isso acontecer diminui exponencialmente à medida que novos blocos são adicionados.\n\n5. Rede\nA rede funciona da seguinte maneira:\nNovas transações são transmitidas para todos os nós.\nCada nó coleta transações em um bloco.\nCada nó trabalha para encontrar uma prova de trabalho difícil para seu bloco.\nQuando um nó encontra uma prova válida, ele transmite o bloco para todos os nós.\nOs nós aceitam o bloco se todas as transações forem válidas e não gastarem novamente.\nOs nós expressam sua aceitação trabalhando no próximo bloco da cadeia, usando o hash do bloco aceito como o hash anterior.\n\n6. Incentivo\nPor convenção, a primeira transação em um bloco é uma transação especial que inicia uma nova moeda pertencente ao criador do bloco. Isso adiciona um incentivo para que os nós apoiem a rede, fornecendo poder computacional (mineração). O incentivo pode ser financiado com taxas de transação além da criação de novas moedas.\nUma vez que um número predeterminado de moedas tenha sido distribuído, o incentivo pode passar a ser inteiramente taxas de transação e livre de inflação.\n\n7. Reutilização de Espaço em Disco\nUma vez que a última transação de uma moeda esteja enterrada sob blocos suficientes, as transações anteriores podem ser descartadas para economizar espaço em disco. Para facilitar isso, as transações são hashadas em uma árvore Merkle, com apenas o hash raiz sendo armazenado no bloco. Blocos antigos podem ser compactados removendo as transações e mantendo apenas os hashes raiz da árvore.\n\n8. Verificação Simplificada de Pagamentos\nÉ possível verificar pagamentos sem executar um nó completo. Um usuário só precisa manter uma cópia dos cabeçalhos dos blocos da cadeia mais longa, que podem ser obtidos consultando os nós da rede, até que esteja convencido da validade da prova de trabalho.\n\n9. Combinação e Divisão de Valor\nEmbora seja possível tratar cada centavo separadamente, isso seria ineficiente. Para permitir divisão e combinação de valores, as transações contêm múltiplas entradas e saídas. Normalmente, há uma entrada de valor maior e duas saídas: uma para o pagamento e outra devolvendo o troco.\n\n10. Privacidade\nO modelo tradicional de banco alcança privacidade limitando o acesso à informação. O modelo Bitcoin torna as transações públicas, mas ainda mantém a privacidade por meio de endereços públicos anônimos. Para manter a privacidade, cada transação deve usar um novo par de chaves públicas/privadas.\n\n11. Cálculos\nConsideramos o cenário de um atacante tentando gerar uma cadeia alternativa mais longa que a dos nós honestos. Mesmo se isso for possível, a probabilidade de sucesso diminui exponencialmente com o número de blocos subsequentes. A segurança da rede depende da probabilidade do atacante ser superado pelos nós honestos.\n\n12. Conclusão\nPropusemos um sistema peer-to-peer para transações eletrônicas sem depender de confiança. Começamos com uma rede de carimbo de data/hora baseada em prova de trabalho para registrar um histórico público. Enquanto a maioria do poder computacional for honesto, a rede permanecerá segura. O sistema é robusto, não exige autoridades centrais e permite liberdade e privacidade nas transações."
    }
]

